/*Задача 3:
Напигите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка). 
Например: 4 -> Да
		 -3 -> Нет
	      7 -> Нет */
          
int N = -3;
if (N % 2 == 0){
    Console.WriteLine("Yes!");
}
else
{
    Console.WriteLine("No!");
}

 